
obscene = ['еб', 'бляд', 'еба', 'еб', 'ёб' 'ебл', 'пизд', 'ху', 'бля', 'блядин', 'блядск', 'блят', 'блядств', 'впиздяч',
           'выблядова', 'выблядок', 'выебон', 'выебыва',  'доеба', 'доебыва', 'доеб', 'еба', 'ебальник', 'ебанеш',
           'ебнул', 'ебаш', 'жидоеб', 'жидоебк', 'заеб', 'заебизъебнул', 'испиздел',  'запиздел', 'припиздет',
           'пропиздел', 'наебаш', 'объеб', 'однохуйствен', 'остоеба', 'пезд', 'пизд', 'пиздабол', 'пиздаболк', 'пиздат',
           'пиздец', 'пиздецк', 'пиздобрат', 'пиздопляск', 'пиздрик', 'подъебк', 'подъбнут', 'подъебнул', 'пизд',
           'пиздец', 'пиздел', 'пиздет', 'поебен', 'распиздош', 'распиздя', 'распиздяйк', 'скотоеб', 'скотоебин',
           'страхоебищ', 'уеба', 'уебищ', 'хитровыеба', 'хуев', 'хуйн', 'хуеплет', 'хуесос', 'жоп', 'дерьм', 'сук',
           'мраз', 'сволоч']

parasites = ['как бы', 'собственно', 'говоря', 'таким образом', 'буквально', 'прямо', 'как говорится', 'так далее',
             'скажем', 'ведь как его', 'в натуре', 'так вот', 'короче', 'как сказать',
             'видишь', 'слышишь', 'типа', 'на самом деле', 'вообще', 'в общем то', 'в общем', 'в некотором роде',
             'на фиг', 'на хрен', 'в принципе', 'и так', 'типа того', 'типа', 'только', 'вот',
             'в самом деле', 'всё такое', 'в целом', 'то есть', 'это самое', 'ешкин кот', 'вот', 'ну это', 'прикинь',
             'прикол', 'значит', 'знаешь так', 'сказать', 'понимаешь', 'допустим', 'слушай',
             'например', 'просто', 'конкретно', 'да ладно', 'блин', 'походу', 'ааа', 'эээ', 'не вопрос', 'без проблем',
             'практически', 'фактически', 'как то так', 'ничего себе', 'достаточно']


required = ['магнит', 'меня зовут', 'хорошего дня', 'хорошего вечера', 'как я могу к вам обращаться', 'до свидания',
            'оцените качество', 'здравствуйте']


polite = ['спасибо', 'пожалуйста']